## Plan Result (prod_frontdoor)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 2 to change, 1 to destroy.</code></pre>

* Update
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;ejudiciary-home-apex&#34;]
  * module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]
* Replace
  * module.premium_front_door.azurerm_cdn_frontdoor_secret.certificate[&#34;ejudiciary-home-apex&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["ejudiciary-home-apex"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
        id                       = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/customDomains/ejudiciary-home-apex"
        name                     = "ejudiciary-home-apex"
        # (3 unchanged attributes hidden)

      ~ tls {
          ~ cdn_frontdoor_secret_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/secrets/ejudiciaryhomeapex-managed-secret" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_secret.certificate["ejudiciary-home-apex"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_secret" "certificate" {
      + cdn_frontdoor_profile_name = (known after apply)
      ~ id                         = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/secrets/ejudiciaryhomeapex-managed-secret" -> (known after apply)
        name                       = "ejudiciaryhomeapex-managed-secret"
        # (1 unchanged attribute hidden)

      ~ secret {
          ~ customer_certificate {
              ~ key_vault_certificate_id  = "https://acmedtssdsprod.vault.azure.net/certificates/ejudiciary-net/fb3d4ff568654816944ef1a507c7731a" -> "https://acmedtssdsprod.vault.azure.net/certificates/ejudiciary-net/b31e703227dc44708c9f13401f6b79c7" # forces replacement
              ~ subject_alternative_names = [
                  - "*.ejudiciary.net",
                  - "ejudiciary.net",
                ] -> (known after apply)
            }
        }
    }

  # module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod|fd-log-analytics-logs-sa"
        name               = "fd-log-analytics-logs-sa"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":618,"Program":"tfcmt","SHA1":"","Target":"prod_frontdoor","Vars":{}} -->